title: Obfuscated whoami.exe Command Line Execution
id: 0946afb5-1398-4885-aa2f-b2af2f4dfdcc
description: Detects execution of whoami.exe with obfuscated command line arguments, which may indicate attempts to evade detection.
author: Yusuke Nakajima
date: 2025-03-02
tags:
  - attack.discovery
  - attack.t1087.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4688
    Image|endswith: '\\whoami.exe'
    CommandLine|re:
      - '(?i)whoami.*[-/]\s*u\s*s\s*e\s*r'
  condition: selection
falsepositives:
  - Legitimate use of whoami.exe with arguments for administrative purposes.
level: medium
