title: Suspicious cmd.exe Execution Running whoami Command
id: 9e73dd06-c5f3-4899-853e-652d1852caac
status: test
description: Detects cmd.exe executing the whoami command, which can be used for user enumeration or reconnaissance.
references:
    - https://attack.mitre.org/techniques/T1069/002/
author: Yusuke Nakajima
date: 2025-03-02
tags:
    - attack.discovery
    - attack.t1069.002
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmdline:
        CommandLine|re:
            - '(?i)cmd\.exe\s+\/c\s+whoami'
    condition: selection_cmdline
falsepositives:
    - Legitimate scripts or administrative tasks invoking whoami via cmd.exe.
level: medium
