title: Detection of 'whoami.exe' Execution with '/user' Argument
id: b47ab589-7e03-44fd-a12a-9524d625593f
description: Detects the execution of 'whoami.exe' with the '/user' argument, which can be used by attackers for user enumeration.
author: Yusuke Nakajima
date: 2025-03-02
tags:
  - attack.execution
  - attack.discovery
  - attack.t1033
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    Image|endswith: '\\whoami.exe'
    CommandLine|contains: '/user'
  condition: selection
falsepositives:
  - Legitimate use of 'whoami /user' command by administrators or for troubleshooting purposes.
level: medium
