title: Detection of Obfuscated 'whoami.exe' Execution with '/user' Argument
id: 42006cc7-c4d9-44bd-ac69-a1db74c46a58
description: Detects the execution of 'whoami.exe' with obfuscated '/user' arguments, potentially used by attackers for user enumeration through command line obfuscation.
author: Yusuke Nakajima
date: 2025-03-02
tags:
  - attack.execution
  - attack.discovery
  - attack.t1033
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    Image|endswith: '\\whoami.exe'
    CommandLine|re: '(?i)/u[^a-zA-Z0-9]*s[^a-zA-Z0-9]*e[^a-zA-Z0-9]*r'
  condition: selection
falsepositives:
  - Legitimate use with unusual command line syntax, but these are rare.
level: medium
