title: Code.exe Making DNS Query to aterm.me on Port 53
id: 18c02445-233e-45e4-95d5-b224a7a55532
description: Detects 'Code.exe' process making DNS queries to 'aterm.me' on port 53, which may indicate exfiltration or command and control activity.
author: Yusuke Nakajima
date: 2025-03-06
tags:
  - attack.exfiltration
  - attack.command_and_control
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    Image|endswith:
      - '\\Code.exe'
    DestinationHostname: 'aterm.me'
    DestinationPort: 53
  condition: selection
falsepositives:
  - Legitimate usage of Visual Studio Code making DNS queries to 'aterm.me' if applicable.
level: medium
