title: CertUtil Executed from Command Prompt with Malicious Parameters
id: f0e1d2c3-b4a5-6789-0fed-cba987654321
status: test
description: Detects certutil.exe being executed by cmd.exe with parameters indicative of downloading or uploading data, potentially for malicious purposes.
author: Yusuke Nakajima
date: 2025-03-02
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1204
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 1
    OriginalFileName: 'certutil.exe'
    ParentImage|endswith: '\cmd.exe'
    CommandLine|re:
      - '(?i)c[^a-zA-Z0-9]*e[^a-zA-Z0-9]*r[^a-zA-Z0-9]*t[^a-zA-Z0-9]*u[^a-zA-Z0-9]*t[^a-zA-Z0-9]*i[^a-zA-Z0-9]*l[^a-zA-Z0-9]* [^-]*(-f|-urlcache)'
      - '(?i)h[^a-zA-Z0-9]*t[^a-zA-Z0-9]*t[^a-zA-Z0-9]*p[^a-zA-Z0-9]*s?:\/\/'
  condition: selection
falsepositives:
  - Authorized scripts or administrative commands utilizing certutil.exe for legitimate network tasks.
level: high
