title: CertUtil Executed via Command Prompt with Malicious Parameters
id: a5b6c7d8-e9f0-1a2b-3c4d-5e6f7g8h9i0j
status: test
description: Detects certutil.exe being executed by cmd.exe with parameters indicative of downloading or uploading data, potentially for malicious purposes.
author: Yusuke Nakajima
date: 2025-03-02
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1204
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 1
    OriginalFileName: 'certutil.exe'
    ParentImage|endswith: '\\cmd.exe'
    CommandLine|re:
      - '(?i)c[^a-zA-Z0-9]*e[^a-zA-Z0-9]*r[^a-zA-Z0-9]*t[^a-zA-Z0-9]*u[^a-zA-Z0-9]*t[^a-zA-Z0-9]*i[^a-zA-Z0-9]*l[^a-zA-Z0-9]*\s+[-/](f|urlcache)'
      - '(?i)h[^a-zA-Z0-9]*t[^a-zA-Z0-9]*t[^a-zA-Z0-9]*p[^a-zA-Z0-9]*s?:\/\/'
  condition: selection
falsepositives:
  - Authorized scripts or administrative commands utilizing certutil.exe for legitimate network tasks.
level: high
