title: Suspicious whoami.exe Execution via cmd.exe
id: 554a31bf-521e-4b46-8286-766ffeb578b0
status: test
description: Detects execution of whoami.exe initiated by cmd.exe, which can be used for user enumeration.
references:
    - https://attack.mitre.org/techniques/T1069/002/
author: Yusuke Nakajima
date: 2025-03-02
tags:
    - attack.discovery
    - attack.t1069.002
logsource:
    category: process_creation
    product: windows
detection:
    selection_process:
        OriginalFileName: 'whoami.exe'
    selection_parent:
        ParentImage|endswith: '\\cmd.exe'
    selection_cmdline:
        CommandLine|re:
            - '(?i)\bwhoami\b'
    condition: selection_process and selection_parent and selection_cmdline
falsepositives:
    - Legitimate administrative or troubleshooting activities using whoami.exe via cmd.exe.
level: medium
