title: Suspicious CertUtil.exe Execution Initiated by CMD.exe
id: f1e2d3c4-b5a6-0987-fedc-6543210fedcb
description: |
    Detects the execution of certutil.exe initiated by cmd.exe with parameters indicative of file downloads, enhancing detection through parent-child process relationships.
author: Yusuke Nakajima
date: 2025-03-02
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1203
logsource:
  category: process_creation
  product: windows
detection:
  parent_process:
    Image|endswith:
      - '\cmd.exe'
    OriginalFileName|contains:
      - 'cmd.exe'
  child_process:
    OriginalFileName|contains:
      - 'certutil.exe'
    CommandLine|contains|all:
      - '/urlcache'
      - 'https://'
  condition: parent_process and child_process
falsepositives:
  - Legitimate administrative or scripting activities involving cmd.exe and certutil.exe.
level: high
